---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketch
source: html/85af8ba4-7def-183f-a518-ddcccad470ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketch Property

The sketch contains an extremely short line.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShortCurveInSketch { get; }
```